app/Controllers/admin/Log.php

    public function getLogType(){
        try{
            $row = [];
            $query = $this->log->select('type')->groupBy('type')->get();
            if($query->getNumRows() > 0){
                $row = $query->getResult();
---
SELECT `type`
FROM `logs`
GROUP BY `type`